Revit 2024 API
DocumentDifference.GetDeletedElementIds Method
 Deleted element id collection. For non-worksharing models, this will always be an empty collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ISet<ElementId> GetDeletedElementIds()
Visual Basic
Public Function GetDeletedElementIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetDeletedElementIds()
See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace